/*************************************************************************
	> File Name: euler_2.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月31日 星期二 12时40分37秒
 ************************************************************************/

#include<stdio.h>

int main() {
    int a = 1, b = 1, c, i, sum = 0;
    for(i = 1; i < 4000000; i++) {
        c = a;
        a = b;
        b = c + b;
        if(b % 2 == 0) {
            sum += b;
        }
        if(b > 4000000) {
            break;
        }
    }
    printf("%d\n", sum);
    return 0;
}
