/*************************************************************************
	> File Name: Euler_16.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月26日 星期四 17时50分25秒
 ************************************************************************/

#include <stdio.h>
 
  
int main() {
    int a[1000]; 
    int i, j, sum = 0;
    for(i = 0; i<1000; i++) {
        a[i] = 0;
    }
    a[0] = 1;
    for(i = 0; i < 1000; i++) {     //2的1000次方，所以执行1000次
        for(j = 0; j < 1000; j++) { //按位乘2 
            a[j] *= 2;
        }
        for(j = 0; j < 1000; j++) {  //进行进位处理 
            if(a[j] > 9) {          //大于9的需要进1 
                a[j+1]++;           //高一位进1 
                a[j] = a[j] % 10; 
            }
        }
    }
    for(i = 999; i >= 0; i--) {
        sum += a[i];
    }
    printf("%d", sum);
    printf("\n");
    return 0;
}
